; domain
(define (domain driverlog)
  (:requirements :typing :fluents) 
  (:types           location locatable - object
		driver truck obj - locatable)

  (:predicates 
		(at ?obj - locatable ?loc - location)
		(in ?obj1 - obj ?obj - truck)
		(driving ?d - driver ?v - truck)
		(link ?x ?y - location) (path ?x ?y - location)
		(empty ?v - truck)
)
  (:functions 	(time-to-walk ?l1 ?l2 - location)
		(time-to-drive ?l1 ?l2 - location)
		(fuel-used)
		(fuel-per-minute ?t - truck)
		(load ?t - truck)
  )


(:action LOAD-TRUCK
  :parameters
   (?obj - obj
    ?truck - truck
    ?loc - location)
  :precondition
   (and (at ?truck ?loc) (at ?obj ?loc))
  :effect
   (and (not (at ?obj ?loc)) (in ?obj ?truck) (increase (load ?truck) 1)
		(increase (fuel-per-minute ?truck) (+ (load ?truck) 1))))

(:action UNLOAD-TRUCK
  :parameters
   (?obj - obj
    ?truck - truck
    ?loc - location)
  :precondition
   (and (at ?truck ?loc) (in ?obj ?truck))
  :effect
   (and (not (in ?obj ?truck)) (at ?obj ?loc) (decrease (load ?truck) 1)
		(decrease (fuel-per-minute ?truck) (load ?truck))))


(:action BOARD-TRUCK
  :parameters
   (?driver - driver
    ?truck - truck
    ?loc - location)
  :precondition
   (and (at ?truck ?loc) (at ?driver ?loc) (empty ?truck))
  :effect
   (and (not (at ?driver ?loc)) (driving ?driver ?truck) (not (empty ?truck))))

(:action DISEMBARK-TRUCK
  :parameters
   (?driver - driver
    ?truck - truck
    ?loc - location)
  :precondition
   (and (at ?truck ?loc) (driving ?driver ?truck))
  :effect
   (and (not (driving ?driver ?truck)) (at ?driver ?loc) (empty ?truck)))

(:action DRIVE-TRUCK
  :parameters
   (?truck - truck
    ?loc-from - location
    ?loc-to - location
    ?driver - driver)
  :precondition
   (and (at ?truck ?loc-from)
   (driving ?driver ?truck) (link ?loc-from ?loc-to))
  :effect
   (and (not (at ?truck ?loc-from)) (at ?truck ?loc-to)
		(increase (fuel-used) (* (fuel-per-minute ?truck) (time-to-drive ?loc-from ?loc-to)))))

(:action WALK
  :parameters
   (?driver - driver
    ?loc-from - location
    ?loc-to - location)
  :precondition
   (and (at ?driver ?loc-from) (path ?loc-from ?loc-to))
  :effect
   (and (not (at ?driver ?loc-from)) (at ?driver ?loc-to)))

 
)

; problem
(define (problem DLOG-5-5-7-191)
	(:domain driverlog)
	(:objects
	driver1 - driver
	driver2 - driver
	driver3 - driver
	driver4 - driver
	driver5 - driver
	truck1 - truck
	truck2 - truck
	truck3 - truck
	truck4 - truck
	truck5 - truck
	package1 - obj
	package2 - obj
	package3 - obj
	package4 - obj
	package5 - obj
	package6 - obj
	package7 - obj
	s0 - location
	s1 - location
	s2 - location
	s3 - location
	s4 - location
	s5 - location
	s6 - location
	p5-0 - location
	p3-1 - location
	p6-0 - location
	p6-3 - location
	p2-0 - location
	p2-5 - location
	p4-5 - location
	p4-6 - location
	p0-1 - location
	)
	(:init
	(at driver1 s6)
	(at driver2 s0)
	(at driver3 s4)
	(at driver4 s2)
	(at driver5 s0)
	(at truck1 s1)
	(empty truck1)
	(= (load truck1) 0)
	(= (fuel-per-minute truck1) 10)
	(at truck2 s5)
	(empty truck2)
	(= (load truck2) 0)
	(= (fuel-per-minute truck2) 10)
	(at truck3 s6)
	(empty truck3)
	(= (load truck3) 0)
	(= (fuel-per-minute truck3) 10)
	(at truck4 s4)
	(empty truck4)
	(= (load truck4) 0)
	(= (fuel-per-minute truck4) 10)
	(at truck5 s3)
	(empty truck5)
	(= (load truck5) 0)
	(= (fuel-per-minute truck5) 10)
	(at package1 s0)
	(at package2 s1)
	(at package3 s6)
	(at package4 s4)
	(at package5 s4)
	(at package6 s1)
	(at package7 s6)
	(path s5 p5-0)
	(path p5-0 s5)
	(path s0 p5-0)
	(path p5-0 s0)
	(= (time-to-walk s5 p5-0) 5)
	(= (time-to-walk p5-0 s5) 5)
	(= (time-to-walk s0 p5-0) 60)
	(= (time-to-walk p5-0 s0) 60)
	(path s3 p3-1)
	(path p3-1 s3)
	(path s1 p3-1)
	(path p3-1 s1)
	(= (time-to-walk s3 p3-1) 13)
	(= (time-to-walk p3-1 s3) 13)
	(= (time-to-walk s1 p3-1) 31)
	(= (time-to-walk p3-1 s1) 31)
	(path s6 p6-0)
	(path p6-0 s6)
	(path s0 p6-0)
	(path p6-0 s0)
	(= (time-to-walk s6 p6-0) 19)
	(= (time-to-walk p6-0 s6) 19)
	(= (time-to-walk s0 p6-0) 28)
	(= (time-to-walk p6-0 s0) 28)
	(path s6 p6-3)
	(path p6-3 s6)
	(path s3 p6-3)
	(path p6-3 s3)
	(= (time-to-walk s6 p6-3) 63)
	(= (time-to-walk p6-3 s6) 63)
	(= (time-to-walk s3 p6-3) 61)
	(= (time-to-walk p6-3 s3) 61)
	(path s2 p2-0)
	(path p2-0 s2)
	(path s0 p2-0)
	(path p2-0 s0)
	(= (time-to-walk s2 p2-0) 61)
	(= (time-to-walk p2-0 s2) 61)
	(= (time-to-walk s0 p2-0) 50)
	(= (time-to-walk p2-0 s0) 50)
	(path s2 p2-5)
	(path p2-5 s2)
	(path s5 p2-5)
	(path p2-5 s5)
	(= (time-to-walk s2 p2-5) 33)
	(= (time-to-walk p2-5 s2) 33)
	(= (time-to-walk s5 p2-5) 9)
	(= (time-to-walk p2-5 s5) 9)
	(path s4 p4-5)
	(path p4-5 s4)
	(path s5 p4-5)
	(path p4-5 s5)
	(= (time-to-walk s4 p4-5) 4)
	(= (time-to-walk p4-5 s4) 4)
	(= (time-to-walk s5 p4-5) 57)
	(= (time-to-walk p4-5 s5) 57)
	(path s4 p4-6)
	(path p4-6 s4)
	(path s6 p4-6)
	(path p4-6 s6)
	(= (time-to-walk s4 p4-6) 23)
	(= (time-to-walk p4-6 s4) 23)
	(= (time-to-walk s6 p4-6) 28)
	(= (time-to-walk p4-6 s6) 28)
	(path s0 p0-1)
	(path p0-1 s0)
	(path s1 p0-1)
	(path p0-1 s1)
	(= (time-to-walk s0 p0-1) 50)
	(= (time-to-walk p0-1 s0) 50)
	(= (time-to-walk s1 p0-1) 65)
	(= (time-to-walk p0-1 s1) 65)
	(link s2 s3)
	(link s3 s2)
	(= (time-to-drive s2 s3) 50)
	(= (time-to-drive s3 s2) 50)
	(link s1 s2)
	(link s2 s1)
	(= (time-to-drive s1 s2) 16)
	(= (time-to-drive s2 s1) 16)
	(link s1 s4)
	(link s4 s1)
	(= (time-to-drive s1 s4) 54)
	(= (time-to-drive s4 s1) 54)
	(link s4 s2)
	(link s2 s4)
	(= (time-to-drive s4 s2) 50)
	(= (time-to-drive s2 s4) 50)
	(link s4 s3)
	(link s3 s4)
	(= (time-to-drive s4 s3) 14)
	(= (time-to-drive s3 s4) 14)
	(link s4 s5)
	(link s5 s4)
	(= (time-to-drive s4 s5) 61)
	(= (time-to-drive s5 s4) 61)
	(link s4 s6)
	(link s6 s4)
	(= (time-to-drive s4 s6) 63)
	(= (time-to-drive s6 s4) 63)
	(link s6 s2)
	(link s2 s6)
	(= (time-to-drive s6 s2) 64)
	(= (time-to-drive s2 s6) 64)
	(link s6 s3)
	(link s3 s6)
	(= (time-to-drive s6 s3) 52)
	(= (time-to-drive s3 s6) 52)
	(link s0 s3)
	(link s3 s0)
	(= (time-to-drive s0 s3) 7)
	(= (time-to-drive s3 s0) 7)
	(link s5 s0)
	(link s0 s5)
	(= (time-to-drive s5 s0) 46)
	(= (time-to-drive s0 s5) 46)
	(link s5 s6)
	(link s6 s5)
	(= (time-to-drive s5 s6) 32)
	(= (time-to-drive s6 s5) 32)
	(= (fuel-used) 0)
)
	(:goal (and
	(at driver1 s3)
	(at driver2 s1)
	(at driver3 s1)
	(at driver4 s5)
	(at driver5 s0)
	(at truck1 s1)
	(at truck2 s0)
	(at truck4 s2)
	(at package1 s0)
	(at package2 s5)
	(at package3 s1)
	(at package4 s2)
	(at package5 s6)
	(at package6 s4)
	(at package7 s6)
	))

(:metric minimize (+ (* 4 (total-time)) (* 4 (fuel-used))))

)

; plan
1. (walk driver1 s6 p6-3)
   deleted: (at driver1 s6)
   added: (at driver1 p6-3)
   goals met: 4 of 15
2. (walk driver4 s2 p2-5)
   deleted: (at driver4 s2)
   added: (at driver4 p2-5)
   goals met: 4 of 15
3. (board-truck driver3 truck4 s4)
   deleted: (at driver3 s4) (empty truck4)
   added: (driving driver3 truck4)
   goals met: 4 of 15
4. (walk driver1 p6-3 s3)
   deleted: (at driver1 p6-3)
   added: (at driver1 s3)
   goals met: 5 of 15
5. (walk driver4 p2-5 s5)
   deleted: (at driver4 p2-5)
   added: (at driver4 s5)
   goals met: 6 of 15
6. (walk driver2 s0 p0-1)
   deleted: (at driver2 s0)
   added: (at driver2 p0-1)
   goals met: 6 of 15
7. (walk driver2 p0-1 s1)
   deleted: (at driver2 p0-1)
   added: (at driver2 s1)
   goals met: 7 of 15
8. (load-truck package4 truck4 s4)
   deleted: (at package4 s4)
   added: (in package4 truck4)
   changed: (load truck4) from 0 to 1, (fuel-per-minute truck4) from 10 to 11
   goals met: 7 of 15
9. (load-truck package5 truck4 s4)
   deleted: (at package5 s4)
   added: (in package5 truck4)
   changed: (load truck4) from 1 to 2, (fuel-per-minute truck4) from 11 to 13
   goals met: 7 of 15
10. (drive-truck truck4 s4 s2 driver3)
   deleted: (at truck4 s4)
   added: (at truck4 s2)
   changed: (fuel-used) from 0 to 650
   goals met: 8 of 15
11. (unload-truck package4 truck4 s2)
   deleted: (in package4 truck4)
   added: (at package4 s2)
   changed: (load truck4) from 2 to 1, (fuel-per-minute truck4) from 13 to 11
   goals met: 9 of 15
12. (drive-truck truck4 s2 s6 driver3)
   deleted: (at truck4 s2)
   added: (at truck4 s6)
   changed: (fuel-used) from 650 to 1354
   goals met: 8 of 15
13. (unload-truck package5 truck4 s6)
   deleted: (in package5 truck4)
   added: (at package5 s6)
   changed: (load truck4) from 1 to 0, (fuel-per-minute truck4) from 11 to 10
   goals met: 9 of 15
14. (load-truck package2 truck1 s1)
   deleted: (at package2 s1)
   added: (in package2 truck1)
   changed: (load truck1) from 0 to 1, (fuel-per-minute truck1) from 10 to 11
   goals met: 9 of 15
15. (load-truck package6 truck1 s1)
   deleted: (at package6 s1)
   added: (in package6 truck1)
   changed: (load truck1) from 1 to 2, (fuel-per-minute truck1) from 11 to 13
   goals met: 9 of 15
16. (load-truck package3 truck4 s6)
   deleted: (at package3 s6)
   added: (in package3 truck4)
   changed: (load truck4) from 0 to 1, (fuel-per-minute truck4) from 10 to 11
   goals met: 9 of 15
17. (board-truck driver2 truck1 s1)
   deleted: (at driver2 s1) (empty truck1)
   added: (driving driver2 truck1)
   goals met: 8 of 15
18. (drive-truck truck1 s1 s4 driver2)
   deleted: (at truck1 s1)
   added: (at truck1 s4)
   changed: (fuel-used) from 1354 to 2056
   goals met: 7 of 15
19. (drive-truck truck4 s6 s2 driver3)
   deleted: (at truck4 s6)
   added: (at truck4 s2)
   changed: (fuel-used) from 2056 to 2760
   goals met: 8 of 15
20. (unload-truck package6 truck1 s4)
   deleted: (in package6 truck1)
   added: (at package6 s4)
   changed: (load truck1) from 2 to 1, (fuel-per-minute truck1) from 13 to 11
   goals met: 9 of 15
21. (drive-truck truck4 s2 s1 driver3)
   deleted: (at truck4 s2)
   added: (at truck4 s1)
   changed: (fuel-used) from 2760 to 2936
   goals met: 8 of 15
22. (unload-truck package3 truck4 s1)
   deleted: (in package3 truck4)
   added: (at package3 s1)
   changed: (load truck4) from 1 to 0, (fuel-per-minute truck4) from 11 to 10
   goals met: 9 of 15
23. (disembark-truck driver3 truck4 s1)
   deleted: (driving driver3 truck4)
   added: (at driver3 s1) (empty truck4)
   goals met: 10 of 15
24. (drive-truck truck1 s4 s1 driver2)
   deleted: (at truck1 s4)
   added: (at truck1 s1)
   changed: (fuel-used) from 2936 to 3530
   goals met: 11 of 15
25. (disembark-truck driver2 truck1 s1)
   deleted: (driving driver2 truck1)
   added: (at driver2 s1) (empty truck1)
   goals met: 12 of 15
26. (unload-truck package2 truck1 s1)
   deleted: (in package2 truck1)
   added: (at package2 s1)
   changed: (load truck1) from 1 to 0, (fuel-per-minute truck1) from 11 to 10
   goals met: 12 of 15
27. (board-truck driver4 truck2 s5)
   deleted: (at driver4 s5) (empty truck2)
   added: (driving driver4 truck2)
   goals met: 11 of 15
28. (load-truck package2 truck4 s1)
   deleted: (at package2 s1)
   added: (in package2 truck4)
   changed: (load truck4) from 0 to 1, (fuel-per-minute truck4) from 10 to 11
   goals met: 11 of 15
29. (board-truck driver2 truck4 s1)
   deleted: (at driver2 s1) (empty truck4)
   added: (driving driver2 truck4)
   goals met: 10 of 15
30. (disembark-truck driver4 truck2 s5)
   deleted: (driving driver4 truck2)
   added: (at driver4 s5) (empty truck2)
   goals met: 11 of 15
31. (drive-truck truck4 s1 s4 driver2)
   deleted: (at truck4 s1)
   added: (at truck4 s4)
   changed: (fuel-used) from 3530 to 4124
   goals met: 11 of 15
32. (drive-truck truck4 s4 s5 driver2)
   deleted: (at truck4 s4)
   added: (at truck4 s5)
   changed: (fuel-used) from 4124 to 4795
   goals met: 11 of 15
33. (unload-truck package2 truck4 s5)
   deleted: (in package2 truck4)
   added: (at package2 s5)
   changed: (load truck4) from 1 to 0, (fuel-per-minute truck4) from 11 to 10
   goals met: 12 of 15
34. (drive-truck truck4 s5 s6 driver2)
   deleted: (at truck4 s5)
   added: (at truck4 s6)
   changed: (fuel-used) from 4795 to 5115
   goals met: 12 of 15
35. (board-truck driver4 truck2 s5)
   deleted: (at driver4 s5) (empty truck2)
   added: (driving driver4 truck2)
   goals met: 11 of 15
36. (drive-truck truck2 s5 s6 driver4)
   deleted: (at truck2 s5)
   added: (at truck2 s6)
   changed: (fuel-used) from 5115 to 5435
   goals met: 11 of 15
37. (drive-truck truck2 s6 s3 driver4)
   deleted: (at truck2 s6)
   added: (at truck2 s3)
   changed: (fuel-used) from 5435 to 5955
   goals met: 11 of 15
38. (drive-truck truck4 s6 s2 driver2)
   deleted: (at truck4 s6)
   added: (at truck4 s2)
   changed: (fuel-used) from 5955 to 6595
   goals met: 12 of 15
39. (disembark-truck driver2 truck4 s2)
   deleted: (driving driver2 truck4)
   added: (at driver2 s2) (empty truck4)
   goals met: 12 of 15
40. (drive-truck truck2 s3 s4 driver4)
   deleted: (at truck2 s3)
   added: (at truck2 s4)
   changed: (fuel-used) from 6595 to 6735
   goals met: 12 of 15
41. (drive-truck truck2 s4 s2 driver4)
   deleted: (at truck2 s4)
   added: (at truck2 s2)
   changed: (fuel-used) from 6735 to 7235
   goals met: 12 of 15
42. (disembark-truck driver4 truck2 s2)
   deleted: (driving driver4 truck2)
   added: (at driver4 s2) (empty truck2)
   goals met: 12 of 15
43. (board-truck driver2 truck2 s2)
   deleted: (at driver2 s2) (empty truck2)
   added: (driving driver2 truck2)
   goals met: 12 of 15
44. (walk driver4 s2 p2-5)
   deleted: (at driver4 s2)
   added: (at driver4 p2-5)
   goals met: 12 of 15
45. (walk driver4 p2-5 s5)
   deleted: (at driver4 p2-5)
   added: (at driver4 s5)
   goals met: 13 of 15
46. (drive-truck truck2 s2 s3 driver2)
   deleted: (at truck2 s2)
   added: (at truck2 s3)
   changed: (fuel-used) from 7235 to 7735
   goals met: 13 of 15
47. (drive-truck truck2 s3 s0 driver2)
   deleted: (at truck2 s3)
   added: (at truck2 s0)
   changed: (fuel-used) from 7735 to 7805
   goals met: 14 of 15
48. (disembark-truck driver2 truck2 s0)
   deleted: (driving driver2 truck2)
   added: (at driver2 s0) (empty truck2)
   goals met: 14 of 15
49. (walk driver2 s0 p0-1)
   deleted: (at driver2 s0)
   added: (at driver2 p0-1)
   goals met: 14 of 15
50. (walk driver2 p0-1 s1)
   deleted: (at driver2 p0-1)
   added: (at driver2 s1)
   goals met: 15 of 15
